In [58]:
import pandas as pd
df = pd.read_csv('pokemon_data.csv')
print(df)

       #                   Name   Type 1  Type 2  HP  Attack  Defense  \
0      1              Bulbasaur    Grass  Poison  45      49       49
1      2                Ivysaur    Grass  Poison  60      62       63
2      3               Venusaur    Grass  Poison  80      82       83
3      3  VenusaurMega Venusaur    Grass  Poison  80     100      123
4      4             Charmander     Fire     NaN  39      52       43
..   ...                    ...      ...     ...  ..     ...      ...
795  719                Diancie     Rock   Fairy  50     100      150
796  719    DiancieMega Diancie     Rock   Fairy  50     160      110
797  720    HoopaHoopa Confined  Psychic   Ghost  80     110       60
798  720     HoopaHoopa Unbound  Psychic    Dark  80     160       60
799  721              Volcanion     Fire   Water  80     110      120

     Sp. Atk  Sp. Def  Speed  Generation  Legendary
0         65       65     45           1      False
1         80       80     60           1      False
2        100      100     80           1      False
3        122      120     80           1      False
4         60       50     65           1      False
..       ...      ...    ...         ...        ...
795      100      150     50           6       True
796      160      110    110           6       True
797      150      130     70           6       True
798      170      130     80           6       True
799      130       90     70           6       True

[800 rows x 12 columns]

In [66]:
# df['Total'] = df['HP'] + df['Attack'] + df['Defense'] + df['Sp. Atk'] + df['Sp. Def'] +df['Speed']
# df.head(5)
# df.drop(columns='Total')

# Another Way of creating new columns
# df['Total'] = df.iloc[:,4:10].sum(axis = 1)
# print(df.head(5))

## Rearrange columns
# cols = list(df.columns)
# df = df[[cols[12]]+ cols[0:4] + cols[4:11]]

df = df[[cols[1]] + [cols[0]] + cols[2:12]]
print(df.head(5))

   #  Total                   Name Type 1  Type 2  HP  Attack  Defense  \
0  1    318              Bulbasaur  Grass  Poison  45      49       49
1  2    405                Ivysaur  Grass  Poison  60      62       63
2  3    525               Venusaur  Grass  Poison  80      82       83
3  3    625  VenusaurMega Venusaur  Grass  Poison  80     100      123
4  4    309             Charmander   Fire     NaN  39      52       43

   Sp. Atk  Sp. Def  Speed  Generation
0       65       65     45           1
1       80       80     60           1
2      100      100     80           1
3      122      120     80           1
4       60       50     65           1

### Exporting CSV

In [72]:
# df.to_csv('modified.csv',index = False)
# df.to_excel('modified.xlsx',index = False)
df.to_csv('modified.txt',index = False,sep='\t')

In [56]:
df.head(5)

,Attack,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,49,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,62,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,82,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,100,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,52,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

### INDEXING

In [39]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['Pune', 'Mumbai', 'Delhi', 'Bangalore', 'Chennai']
}

df = pd.DataFrame(data)
print(df)
df['Name']
# df[['Name','Age']]
# df.iloc[0:3]
df.loc[0:3]

      Name  Age       City
0    Alice   25       Pune
1      Bob   30     Mumbai
2  Charlie   35      Delhi
3    David   40  Bangalore
4      Eva   45    Chennai

      Name  Age       City
0    Alice   25       Pune
1      Bob   30     Mumbai
2  Charlie   35      Delhi
3    David   40  Bangalore

In [14]:
# df.loc[3]
df.iloc[3]

Name        David
Age            40
City    Bangalore
Name: 3, dtype: object

In [45]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 28]
}, index=['a', 'b', 'c', 'd', 'e'])
# df1.loc['b']
# df1.iloc[1]

# print(df1.loc['b':'d'])
# df.iloc[1]

#  Select only the "Age" column
df['Age']

#  Select the 1st row using iloc
df.iloc[0]

#  Select the row where Name is 'Eva' using loc
print(df[df['Name'] == 'Eva'])

  Name  Age
e  Eva   28

### Slicing in Pandas

In [81]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 28],
    'City': ['Mumbai', 'Delhi', 'Pune', 'Chennai', 'Bangalore']
})

# Task 1: Get rows 1 to 3 and only 'Name' and 'Age' columns using iloc
# Task 2: Get rows with label 'b' to 'd' using loc, if you set custom index
# print(df)

#  Task-1
#df.iloc[1:4,0:2]

#  Task-2
data = { 
    'Name' : ['Pramod','Kanha','Don','Damodar','Savaliya','Radhu'],
    'Age' : [31,2,5,3,3,2],
    'City': ['Nashik','Vrindavan','Nashik','Nashik','Nashik','Barsana']
}
df = pd.DataFrame(data,index=['a','b','c','d','e','f'])
# print(df)
df.loc['b':'d']


#   Column Slicing
# df.iloc[:,0:2]

      Name  Age       City
b    Kanha    2  Vrindavan
c      Don    5     Nashik
d  Damodar    3     Nashik

### Filtering in Pandas

In [95]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 28],
    'City': ['Mumbai', 'Delhi', 'Pune', 'Chennai', 'Bangalore']
}
# df = pd.DataFrame(data)
# #  Filter rows where Age > 30:
# df[df['Age'] > 30]
# #  Filter where City == 'Pune':
# df[df['City'] == 'Pune']
# # Filter using multiple conditions:
# df[(df['Age'] > 30) | (df['City'] == 'Pune')]

#  Filtering Assignment
import pandas as pd

data = {
    'Name': ['Amit', 'Bhavna', 'Chetan', 'Divya', 'Esha', 'Farhan'],
    'Age': [22, 34, 29, 41, 25, 38],
    'City': ['Pune', 'Mumbai', 'Delhi', 'Chennai', 'Pune', 'Mumbai'],
    'Salary': [30000, 55000, 48000, 70000, 35000, 60000]
}

df = pd.DataFrame(data)
# Filter rows where Age > 30
# Filter rows where City is Mumbai
# Filter rows where Salary >= 50000 and Age < 40
# Filter rows where City is Pune OR Salary < 40000
df[df['Age'] > 30]
df[df['City'] == 'Mumbai']
df[(df['Salary'] >=50000) & (df['Age'] < 40)]
df[(df['City'] == 'Pune') | (df['Salary'] < 40000)]

   Name  Age  City  Salary
0  Amit   22  Pune   30000
4  Esha   25  Pune   35000

### Modifying Values

In [170]:
import pandas as pd
data = {
    'Name': ['Amit', 'Neha', 'Raj', 'Sara'],
    'City': ['Pune', 'Mumbai', 'Pune', 'Delhi'],
    'Salary': [30000, 35000, 40000, 28000]
}
# df = pd.DataFrame(data)
# print(df)

# df.loc[2, 'Salary'] = 50000  # Updates salary of index 2 to 50,000

# Increase salary by 2000 only for people in Pune
# df.loc[df['City'] == 'Pune', 'Salary'] = df.loc[df['City'] == 'Pune', 'Salary'] + 2000
# print(df)



import pandas as pd
data = {
    'Name': ['Amit', 'Bhavna', 'Chetan', 'Divya', 'Esha', 'Farhan'],
    'Age': [22, 34, 29, 41, 25, 38],
    'City': ['Pune', 'Mumbai', 'Delhi', 'Chennai', 'Pune', 'Mumbai'],
    'Salary': [30000, 55000, 48000, 70000, 35000, 60000]
}
# df = pd.DataFrame(data)
# print(df)

#  df.iloc[0, 1] = 23  # Updates row 0, column 1 (Age) to 23
df.iloc[0,1] = 23
# print(df)

#  Replace all values in a column:
df['Age'] = df['Age'] +1
# print(df)

# Try increasing salary by 10% for everyone older than 30
df['Salary'] = df['Salary'].astype(float)
df.loc[df['Age']> 30,'Salary'] *= 1.1
print(df)

     Name  Age     City   Salary
0    Amit   24     Pune  30000.0
1  Bhavna   36   Mumbai  66550.0
2  Chetan   31    Delhi  52800.0
3   Divya   43  Chennai  84700.0
4    Esha   27     Pune  35000.0
5  Farhan   40   Mumbai  72600.0

### Creating New Columns

In [187]:
#  Using existing columns
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Salary': [50000, 60000, 70000],
    'Bonus': [5000, 6000, 7000]
})
# Create new column 'Total_Pay' by summing 'Salary' and 'Bonus'
df['Total_Pay'] = df['Salary'] + df['Bonus']
# print(df)

# Using conditions
# Create column 'High_Earner' based on Salary
df['High_Earner'] = df['Salary'] > 55000
# print(df)

#  apply() with custom logic
# Custom label based on bonus
# df['Bonus_Level'] = df['Bonus'].apply(lambda x: 'High' if x > 5500 else 'Low')
# print(df)


df['Bonus_level'] = df['Bonus'].apply(lambda x:'High' if x>5000 else 'low')
#  np.where()
import numpy as np
df['Tax_Bracket'] = np.where(df['Salary'] > 60000,'30%','20%')
print(df)

      Name  Salary  Bonus  Total_Pay  High_Earner Bonus_level Tax_Bracket
0    Alice   50000   5000      55000        False         low         20%
1      Bob   60000   6000      66000         True        High         20%
2  Charlie   70000   7000      77000         True        High         30%

### Assignment

In [218]:
import pandas as pd

data = {
    'Employee': ['Raj', 'Simran', 'Amit', 'Priya', 'Anil'],
    'Experience': [2, 6, 4, 8, 3],
    'CTC': [35000, 55000, 48000, 70000, 40000],
    'Incentive': [2000, 3000, 2500, 4000, 2200]
}

df = pd.DataFrame(data)
print(df)
# For all employees with Experience > 5 years:
# Increase CTC by 15%
# Increase Incentive by â‚¹500
df[['CTC', 'Incentive']] = df[['CTC', 'Incentive']].astype(float)

# df.loc[df['Experience'] > 5,['CTC','Incentive']] = (
#     df.loc[df['Experience'] > 5],['CTC','Incentive'] * [1.15,1.0]
# ) + [0,500]

df[['CTC', 'Incentive']] = df[['CTC', 'Incentive']].astype(float)
df.loc[df['Experience'] > 5, ['CTC', 'Incentive']] = (
    df.loc[df['Experience'] > 5, ['CTC', 'Incentive']] * [1.15, 1.0]
) + [0, 500]

  Employee  Experience    CTC  Incentive
0      Raj           2  35000       2000
1   Simran           6  55000       3000
2     Amit           4  48000       2500
3    Priya           8  70000       4000
4     Anil           3  40000       2200